Catalogs/ПрограммыМедицинскогоСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПрограммыМедицинскогоСтрахования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяПремияСотрудника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяПремияРодственника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ДействияСПрограммамиМедицинскогоСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДействияСПрограммамиМедицинскогоСтрахования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Добавить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИзменять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПрограммыМедицинскогоСтрахования/Forms/ФормаИзменениеУсловий/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Программы") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Страхователь = Параметры.Страхователь;
	Заголовок = Строка(Параметры.Страхователь);
	ДатаНачалаСтрахования = Параметры.ДатаНачалаСтрахования;
	ДатаОкончанияСтрахования = Параметры.ДатаОкончанияСтрахования;
	ДатаПрикрепления = Параметры.ДатаПрикрепления;
	ДатаОткрепления = Параметры.ДатаОткрепления;
	ДатаРождения = Параметры.ДатаРождения;
	ДатаИзменения = Параметры.ДатаИзменения;
	СтраховаяКомпания = Параметры.СтраховаяКомпания;
	
	Для Каждого СтруктураПрограммы Из Параметры.Программы Цикл
		НоваяСтрока = ПрограммыСтрахования.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПрограммы);
		Если НоваяСтрока.Действие = Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.Добавить Тогда
			НоваяСтрока.ДатаНачала = ДатаИзменения;
			НоваяСтрока.ДатаОкончания = ДатаОткрепления;
			НоваяСтрока.Комментарий = СтрШаблон(НСтр("ru = 'прикрепить с %1'"), Формат(НоваяСтрока.ДатаНачала, "ДЛФ=Д"));
		ИначеЕсли НоваяСтрока.Действие = Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.Изменить Тогда
			НоваяСтрока.ДатаОкончания = ДатаИзменения - 1;
			НоваяСтрока.Комментарий = СтрШаблон(НСтр("ru = 'открепить %1'"), Формат(НоваяСтрока.ДатаОкончания, "ДЛФ=Д"));
		ИначеЕсли НоваяСтрока.Действие = Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.НеИзменять Тогда
			НоваяСтрока.Комментарий = СтрШаблон(НСтр("ru = 'откреплен %1'"), Формат(НоваяСтрока.ДатаОкончания, "ДЛФ=Д"));
		КонецЕсли;
		НоваяСтрока.ПериодСтрахования = ПериодСтрахования(НоваяСтрока.ДатаНачала, НоваяСтрока.ДатаОкончания);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Параметры.ШкалаВозрастов, ШкалаВозрастов);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрограммыСтрахования

&НаКлиенте
Процедура ПрограммыСтрахованияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ПрограммыСтрахования.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ТекущиеДанные.ДатаНачала = ДатаИзменения;
		ТекущиеДанные.ДатаОкончания = ДатаОткрепления;
		ТекущиеДанные.ПериодСтрахования = ПериодСтрахования(ТекущиеДанные.ДатаНачала, ТекущиеДанные.ДатаОкончания);
		ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Добавить");
		ТекущиеДанные.Комментарий = СтрШаблон(НСтр("ru = 'прикрепить с %1'"), Формат(ДатаИзменения, "ДЛФ=Д"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрограммыСтрахованияПрограммаСтрахованияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПрограммыСтрахования.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.СтраховаяПремия = СтраховаяПремия(ТекущиеДанные.ПрограммаСтрахования, ТекущиеДанные.ДатаНачала, ТекущиеДанные.ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрограммыСтрахованияПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ПрограммыСтрахования.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОформитьКомандуОткрепления(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрограммыСтрахованияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.ПрограммыСтрахования.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Добавить") Тогда
		ПрограммыСтрахования.Удалить(ПрограммыСтрахования.Индекс(ТекущиеДанные));
		Возврат;
	ИначеЕсли ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Изменить") Тогда
		ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.ПустаяСсылка");
		ТекущиеДанные.ДатаОкончания = ДатаОткрепления;
		ТекущиеДанные.Комментарий = "";
	ИначеЕсли ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.НеИзменять") Тогда
		Возврат;
	Иначе 
		ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Изменить");
		ТекущиеДанные.ДатаОкончания = ДатаИзменения - 1;
		ТекущиеДанные.Комментарий = СтрШаблон(НСтр("ru = 'открепить %1'"), Формат(ДатаИзменения - 1, "ДЛФ=Д"));
	КонецЕсли;
	
	ТекущиеДанные.ПериодСтрахования = ПериодСтрахования(ТекущиеДанные.ДатаНачала, ТекущиеДанные.ДатаОкончания);
	ТекущаяСтрока = ПрограммыСтрахования.НайтиПоИдентификатору(Элементы.ПрограммыСтрахования.ТекущаяСтрока);
	ТекущаяСтрока.СтраховаяПремия =
		СтраховаяПремия(ТекущаяСтрока.ПрограммаСтрахования, ТекущаяСтрока.ДатаНачала, ТекущаяСтрока.ДатаОкончания);
	
	ОформитьКомандуОткрепления(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	МассивСтруктурПрограмм = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ПрограммыСтрахования Цикл
		СтруктураПрограммы = Новый Структура;
		СтруктураПрограммы.Вставить("ПрограммаСтрахования", СтрокаТаблицы.ПрограммаСтрахования);
		СтруктураПрограммы.Вставить("СтраховаяПремия", СтрокаТаблицы.СтраховаяПремия);
		СтруктураПрограммы.Вставить("ДатаНачала", СтрокаТаблицы.ДатаНачала);
		СтруктураПрограммы.Вставить("ДатаОкончания", СтрокаТаблицы.ДатаОкончания);
		СтруктураПрограммы.Вставить("ДатаИзменения", ДатаИзменения);
		СтруктураПрограммы.Вставить("Действие", СтрокаТаблицы.Действие);
		МассивСтруктурПрограмм.Добавить(СтруктураПрограммы);
	КонецЦикла;
	
	Закрыть(МассивСтруктурПрограмм);
	
КонецПроцедуры

&НаКлиенте
Процедура Пересчитать(Команда)
	
	Для Каждого СтрокаТаблицы Из ПрограммыСтрахования Цикл
		СтрокаТаблицы.СтраховаяПремия = СтраховаяПремия(СтрокаТаблицы.ПрограммаСтрахования, СтрокаТаблицы.ДатаНачала, СтрокаТаблицы.ДатаОкончания);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	Элемент = УсловноеОформление.Элементы.Добавить();

	// Оформляемые поля.
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияПрограммаСтрахования.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияПериодСтрахования.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияСтраховаяПремия.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияКомментарий.Имя);

	// Отбор.
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПрограммыСтрахования.Действие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.Добавить;

	// Оформление.
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.РезультатУспехЦвет);

	// Использование.
	Элемент.Использование = Истина;
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	// Оформляемые поля.
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияПрограммаСтрахования.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияПериодСтрахования.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияСтраховаяПремия.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияКомментарий.Имя);

	// Отбор.
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПрограммыСтрахования.Действие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.Изменить;

	// Оформление.
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ВажныеДанныеЦветБЭД);

	// Использование.
	Элемент.Использование = Истина;
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	// Оформляемые поля.
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияПрограммаСтрахования.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияПериодСтрахования.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияСтраховаяПремия.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияКомментарий.Имя);

	// Отбор.
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПрограммыСтрахования.Действие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.НеИзменять;

	// Оформление.
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекста);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Использование.
	Элемент.Использование = Истина;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	// Оформляемые поля.
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияПрограммаСтрахования.Имя);
	
	// Отбор.
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПрограммыСтрахования.Действие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Оформление.
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Использование.
	Элемент.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Функция СтраховаяПремия(ПрограммаСтрахования, ДатаНачала, ДатаОкончания)
	
	ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
	ПараметрыРасчета.ДатаНачала = ДатаНачала;
	ПараметрыРасчета.ДатаОкончания = ДатаОкончания;
	ПараметрыРасчета.ДатаНачалаСтрахования = ДатаНачалаСтрахования;
	ПараметрыРасчета.ДатаОкончанияСтрахования = ДатаОкончанияСтрахования;
	ПараметрыРасчета.ДатаРождения = ДатаРождения;
	ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастов;
	Если ТипЗнч(Страхователь) = Тип("СправочникСсылка.Сотрудники") Тогда
		ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияСотрудника(ПрограммаСтрахования);
	Иначе
		ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияРодственника(ПрограммаСтрахования);
	КонецЕсли;
	
	Возврат МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПериодСтрахования(ДатаНачала, ДатаОкончания)
	Возврат СтрШаблон(НСтр("ru = 'с %1 по %2'"), Формат(ДатаНачала, "ДЛФ=Д"), Формат(ДатаОкончания, "ДЛФ=Д"));
КонецФункции

&НаКлиенте
Процедура ОформитьКомандуОткрепления(ТекущиеДанные)
	
	Если ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Добавить") Тогда
		Элементы.ПрограммыСтрахованияОткрепить.Заголовок = НСтр("ru = 'Удалить'");
		Элементы.ПрограммыСтрахованияОткрепить.Картинка = БиблиотекаКартинок.Удалить;
		Элементы.ПрограммыСтрахованияОткрепить.Видимость = Истина;
	ИначеЕсли ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Изменить") Тогда
		Элементы.ПрограммыСтрахованияОткрепить.Заголовок = НСтр("ru = 'Продолжить'");
		Элементы.ПрограммыСтрахованияОткрепить.Картинка = БиблиотекаКартинок.ОперацияВыполненаУспешно;
		Элементы.ПрограммыСтрахованияОткрепить.Видимость = Истина;
	ИначеЕсли ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.НеИзменять") Тогда
		Элементы.ПрограммыСтрахованияОткрепить.Видимость = Ложь;
	Иначе
		Элементы.ПрограммыСтрахованияОткрепить.Заголовок = НСтр("ru = 'Открепить'");
		Элементы.ПрограммыСтрахованияОткрепить.Картинка = БиблиотекаКартинок.Удалить;
		Элементы.ПрограммыСтрахованияОткрепить.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
